# importing essential libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
movies = pd.read_csv('movies.csv')

In [4]:
movies.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [49]:
rating = pd.read_csv('ratings.csv')

In [50]:
rating['timestamp'] = pd.to_datetime(rating['timestamp'], unit='s')

In [21]:
rating

userId       25000095
movieId      25000095
rating       25000095
timestamp    25000095
dtype: int64

In [51]:
rating.head()

   userId  movieId  rating           timestamp
0       1      296     5.0 2006-05-17 15:34:04
1       1      306     3.5 2006-05-17 12:26:57
2       1      307     5.0 2006-05-17 12:27:08
3       1      665     5.0 2006-05-17 15:13:40
4       1      899     3.5 2006-05-17 12:21:50

In [7]:
link=pd.read_csv('links.csv')

In [35]:
link.isna().sum()/len(link.index)*100

movieId    0.000000
imdbId     0.000000
tmdbId     0.171411
dtype: float64

In [36]:
link.isna().sum()

movieId      0
imdbId       0
tmdbId     107
dtype: int64

In [25]:
link.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62423 entries, 0 to 62422
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  62423 non-null  int64
 1   imdbId   62423 non-null  int64
 2   tmdbId   62316 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 1.4 MB

In [8]:
link.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [9]:
tag=pd.read_csv('tags.csv')

In [40]:
tag.isna().sum()

userId        0
movieId       0
tag          16
timestamp     0
dtype: int64

In [10]:
tag.head()

   userId  movieId               tag   timestamp
0       3      260           classic  1439472355
1       3      260            sci-fi  1439472256
2       4     1732       dark comedy  1573943598
3       4     1732    great dialogue  1573943604
4       4     7569  so bad it's good  1573943455

In [11]:
genome_tag=pd.read_csv('genome-tags.csv')
genome_score= pd.read_csv('genome-scores.csv')

In [44]:
genome_score.isna().sum()

movieId      0
tagId        0
relevance    0
dtype: int64

In [12]:
genome_tag.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [13]:
genome_score.head()

   movieId  tagId  relevance
0        1      1    0.02875
1        1      2    0.02375
2        1      3    0.06250
3        1      4    0.07575
4        1      5    0.14075

In [53]:
movie_rating= pd.merge(movies, rating, on='movieId')

In [54]:
movie_rating.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2,3.5,2006-03-03 19:57:00
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3,4.0,2015-08-13 13:23:35
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,4,3.0,2019-11-16 22:44:12
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,1997-03-17 19:12:29
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8,4.0,1998-03-21 15:01:57

In [72]:
movie_rating['movieId'].unique

<bound method Series.unique of 0                1
1                1
2                1
3                1
4                1
             ...
25000090    209157
25000091    209159
25000092    209163
25000093    209169
25000094    209171
Name: movieId, Length: 25000095, dtype: int64>

In [85]:
movie_rating.pivot_table(values='rating',index='genres').sort_values(by='rating', ascending=False)

                                                 rating
genres
Children|Comedy|Documentary                        5.00
Adventure|Drama|Romance|War|Western                5.00
Adventure|Fantasy|Sci-Fi|Western                   5.00
Action|Comedy|Mystery                              5.00
Action|Drama|Mystery|Romance|Sci-Fi|Thriller       5.00
...                                                 ...
Action|Adventure|Drama|Horror|Sci-Fi               0.75
Action|Adventure|Comedy|Drama|Romance|Western      0.50
Documentary|Drama|Horror                           0.50
Comedy|Horror|Mystery|Romance                      0.50
Action|Adventure|Fantasy|Horror|Sci-Fi|Thriller    0.50

[1621 rows x 1 columns]